tutorials/scalarTransportQHDFoam/1D/frontTrack/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     4.1;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoQGDThermo;
    mixture         pureMixture;
    transport       const;
    thermo          eConst;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleInternalEnergy;
}

// Note: these are the properties for fuel

mixture
{
    specie
    {
        nMoles          1;
        molWeight       1;
    }

    
    thermodynamics
    {
        Hf              0;
        Sf              0;
        Cp              1;
        Cv              1;
    }
    
    transport
    {
        mu   0;
        Pr   0.73;
        beta 0;
    }
}

QGD
{
    pRefCell		0;
    pRefValue		1;
    implicitDiffusion true;
    QGDCoeffs constTau;
    constTauDict
    {
       Tau 5e-3;
    }
}
